---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerRequiredRemoveFromGroup
source: html/60730f9c-74a5-9ee9-4acc-d0f96283ee1e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.CouplerRequiredRemoveFromGroup Property

The coupler is invalid in group.

## Syntax (C#)
```csharp
public static FailureDefinitionId CouplerRequiredRemoveFromGroup { get; }
```